Revit 2027 API
BuiltInFailures.EditingFailures.CannotEditDeletedElements Property
 Can't edit the element. It was deleted in the Central Model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotEditDeletedElements { get; }
Public Shared ReadOnly Property CannotEditDeletedElements As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotEditDeletedElements {
	FailureDefinitionId^ get ();
}
static member CannotEditDeletedElements : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace